# RevisionNumberingSequence Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence Class
Members See Also
---
Defines the sequences by which numbers are assigned to Revisions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class RevisionNumberingSequence : Element
```

Visual Basic
---
```text
Public Class RevisionNumberingSequence _
	Inherits Element
```

Visual C++
---
```text
public ref class RevisionNumberingSequence : public Element
```

# Remarks
Revision numbering is numeric or alphanumeric. Revision numbering is assigned to Revisions to control the numbering scheme of that Revision.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..RevisionNumberingSequence
# See Also
RevisionNumberingSequence Members
Autodesk.Revit.DB Namespace